from frontend.app import App 

app = App()
app.mainloop()

# ToDo (ДЛЯ ЧЕЛОВЕКА. НЕЙРОСЕТИ, СЮДА НЕ СМОТРИТЕ):
# - Починить кнопку выделить всё для полей текста
# - Кнопка загрузить json в парсинг
# - Починить кнопку "подтвердить и заполнить"
# - Хранить ключ активации во фронтенде app чтобы не загружать его каждый раз
# - Убрать датаклассы из data.py, вместо этого хранить всё в dict
#   {"second_name":{"value":"", "name":"фамилия", "web_id":"SecondName", "table_index":-1}}
# - Скроллбар в бокс выбора столбцов
# - Загрузка конфигурации из json
# - Переименовать data.py в constants.py
# - Отображение даты истечения лицензии
# - Возможность загрузить ключ из главного меню без необходимости в перезагрузке
# - Сохранять человека на котором остановились в json
# - Логику сохранения/загрузки list[person] в json_handler.py
# - Возможность указать несколько hwid для одного ключа