from frontend.app import App 

app = App()
app.mainloop()

# ToDo:
# - Скроллбар в бокс выбора столбцов
# - Починить кнопку выделить всё для полей текста
# - Кнопка загрузить json в парсинг
# - Хранить ключ активации во фронтенде app чтобы не загружать его каждый раз
# - Загрузка конфигурации из json
# - Отображение даты истечения лицензии
# - Возможность загрузить ключ из главного меню без необходимости в перезагрузке
# - Сохранять человека на котором остановились в json
# - Возможность указать несколько hwid для одного ключа